app/Controllers/Customer.php

    public function index()
    {
        // KATEGORI
        $queryKategori = $this->builderKategori;
        $kategori = $queryKategori->get()->getResult();
---
SELECT *
FROM `kategori`

    public function produk($kat, $filter)
    {

        // AKUN
        $akun = $this->builderAkun->find(session()->get('id'));

        // KATEGORI
        $queryKategori = $this->builderKategori;
        $kategori = $queryKategori->get()->getResult();
---
SELECT *
FROM `kategori`